console.log('それでは始めましょう！');
/**
 * if文
 *
 * 変数「score」の値が
 * 「81~100」の時はコンソールに「大変よくできました」を出力、
 * 「51~80」の時はコンソールに「よくできました」を出力、
 * 「0~50」の時はコンソールに「もう少し頑張りましょう」を出力するコードを書いてみましょう！
 */

// この下にコードを書いてください


/**
 * switch文
 */

/**
 * 問題
 * 変数「season」に季節を表す文字列（例: "春", "夏", "秋", "冬"）が格納されています。
 * 季節に応じて以下のようなメッセージをコンソールに出力するコードを書いてみましょう！
 * "春"の場合は、「花見に行きましょう！」と出力、
 * "夏"の場合は、「プールに行きましょう！」と出力、
 * "秋"の場合は、「散歩に行きましょう！」と出力、
 * "冬"の場合は、「スキーに行きましょう！」と出力、
 * 上記のいずれにも該当しない場合は、「正しい季節を入力してください。」と出力する。
 */

// この下にコードを書いてください


/**
 * for文
 */

/**
 * 1から50までの数字の中から、偶数のみをコンソールに出力してください。
 * （for文とif文を使って解いてみましょう）
 */

// この下にコードを書いてください



/**
 * while文
 */

/**
 * 10から1までの数字を逆順にコンソールに出力してください。
 */

// この下にコードを書いてください


/**
 * アロー関数
 */

/**
 * 問題１
 * 引数として受け取った数値を2倍にして返す関数をアロー関数で書いてみましょう。
 * その後、「5」を引数で渡して関数を実行してみてください。
 */

// この下にコードを書いてください


/**
 * 問題2
 * 引数として受け取った文字列を逆順にして返す関数をアロー関数で書いてみましょう。
 * その後、「今日はいい天気」を引数で渡して関数を実行してみてください。
 */

// この下にコードを書いてください


/**
 * addEventListenerを使って処理を書いてみよう
 */

/**
 * 問題１
 * 下のボタンをクリックすると、コンソールにメッセージを表示するプログラムを作成してください。
 */

// この下にコードを書いてください


/**
 * 問題2
 * マウスが要素の上に乗った時に、要素の背景色を変えるプログラムを作成してください。
 * また、マウスが要素から離れた時には元の背景色に戻るようにしてください。
 */

// この下にコードを書いてください

